In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn, randint

In [4]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [5]:
pd.Series([1,2,3,4],['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
 df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [10]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [11]:
df['new'] = df['W']+df['Y']

In [12]:
df['new']

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
Name: new, dtype: float64

In [13]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [14]:
df.drop('new',axis = 1,
    inplace=True)

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df.drop('E',axis = 0,inplace = True)

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [19]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [20]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [22]:
df.loc['A','W']

2.706849839399938

In [23]:
df.loc['A',['W','Y']]

W    2.706850
Y    0.907969
Name: A, dtype: float64

In [24]:
df.iloc[0,0]

2.706849839399938

In [25]:
randint(10, size=5)

array([7, 4, 8, 7, 6])

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [27]:
df['W']>0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [28]:
df['Y']>0.9

A     True
B    False
C    False
D    False
Name: Y, dtype: bool

In [29]:
(df['W']>0) & (df['Y']>0.9)

A     True
B    False
C    False
D    False
dtype: bool

In [30]:
(df['W']>0) | (df['Y']>0.9)

A     True
B     True
C    False
D     True
dtype: bool

In [31]:
df[(df['W']>0) & (df['Y']>0.9)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [32]:
df[(df['W']>0) | (df['Y']>0.9)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [34]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [35]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [39]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [49]:
df

             A         B
G1 1 -2.711192 -1.522410
   2 -1.416207  1.108544
   3  1.131029  0.498600
G2 1  1.179022  1.322684
   2  1.852155 -0.892172
   3  0.616861 -1.121822

In [56]:
df.loc['G1'].loc[1]['B']

-1.5224104412043946

In [57]:
df.index.names

FrozenList([None, None])

In [58]:
df.index.names = ['groups','num']

In [59]:
df

                   A         B
groups num
G1     1   -2.711192 -1.522410
       2   -1.416207  1.108544
       3    1.131029  0.498600
G2     1    1.179022  1.322684
       2    1.852155 -0.892172
       3    0.616861 -1.121822